zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2s.h
    /** @enum DL_I2S_WCLK_INVERSION
     *  WCLK 极性反转控制。
     */
    typedef enum
    {
        /*! WCLK is not inverted *//*< 不反转 */
        DL_I2S_WCLK_INVERSION_DISABLED = I2S_WCLKSRC_WCLKINV_NOT_INVERTED,
        /*! WCLK is inverted *//*< 反转 */
        DL_I2S_WCLK_INVERSION_ENABLED = I2S_WCLKSRC_WCLKINV_INVERTED,
    } DL_I2S_WCLK_INVERSION;

    /** @enum DL_I2S_PHASE
     *  帧格式相位模式。
     */
    typedef enum
    {
        /*! I2S Single-Phase (DSP format) *//*< 单相位（DSP 格式） */
        DL_I2S_PHASE_SINGLE = I2S_FMTCFG_DUALPHASE_SINGLEPHASE,
        /*! I2S Dual-Phase (I2S, LJF and RJF) *//*< 双相位（I2S/LJF/RJF 格式） */
        DL_I2S_PHASE_DUAL = I2S_FMTCFG_DUALPHASE_DUALPHASE,
    } DL_I2S_PHASE;

    /** @enum DL_I2S_SAMPLE_EDGE
     *  数据采样边沿选择。
     */
    typedef enum
    {
        /*! Data sampled on negative edge, clocked out on positive edge *//*< 下降沿采样，上升沿输出 */
        DL_I2S_SAMPLE_EDGE_NEG = I2S_FMTCFG_SMPLEDGE_NEGEDGE,
        /*! Data sampled on positive edge, clocked out on negative edge *//*< 上升沿采样，下降沿输出 */
        DL_I2S_SAMPLE_EDGE_POS = I2S_FMTCFG_SMPLEDGE_POSEDGE,
    } DL_I2S_SAMPLE_EDGE;

    /** @enum DL_I2S_MEMORY_LENGTH
     *  每个样本的内存访问宽度。
     */
    typedef enum
    {
        /*! 16-bit memory access per sample *//*< 16 位 */
        DL_I2S_MEMORY_LENGTH_16_BIT = I2S_FMTCFG_MEMLEN32_16BIT,
        /*! 32-bit memory access per sample *//*< 32 位 */
        DL_I2S_MEMORY_LENGTH_32_BIT = I2S_FMTCFG_MEMLEN32_32BIT,
    } DL_I2S_MEMORY_LENGTH;

    /** @enum DL_I2S_DATA_DELAY
     *  WCLK 边沿到首字最高位之间的 BCLK 延迟周期数。
     */
    typedef enum
    {
        /*! Zero BCLK period delay between WCLK edge and MSB of first word *//*< 零延迟（LJF/DSP） */
        DL_I2S_DATA_DELAY_ZERO = I2S_FMTCFG_DATADLY_ZERO,
        /*! One BCLK period delay between WCLK edge and MSB of first word *//*< 1 周期延迟（I2S/DSP） */
        DL_I2S_DATA_DELAY_ONE = I2S_FMTCFG_DATADLY_ONE,
        /*! Two BCLK periods delay between WCLK edge and MSB of first word *//*< 2 周期延迟（RJF 最小值） */
        DL_I2S_DATA_DELAY_TWO = I2S_FMTCFG_DATADLY_TWO,
        /*! Max BCLK periods delay between WCLK edge and MSB of first word *//*< 最大延迟（RJF） */
        DL_I2S_DATA_DELAY_MAX = I2S_FMTCFG_DATADLY_MAX,
    } DL_I2S_DATA_DELAY;

    /** @enum DL_I2S_EMPTY_SLOT_OUTPUT
     *  空时隙期间数据引脚输出行为。
     */
    typedef enum
    {
        /*! Send out zeroes in empty slots *//*< 输出全零 */
        DL_I2S_EMPTY_SLOT_OUTPUT_ZERO = I2S_FMTCFG_EMPTYSLOTOUTPUT_ZERO,
        /*! Send out ones in empty slots *//*< 输出全一 */
        DL_I2S_EMPTY_SLOT_OUTPUT_ONE = I2S_FMTCFG_EMPTYSLOTOUTPUT_ONE,
        /*! Tristate data pin line during empty slot *//*< 三态高阻 */
        DL_I2S_EMPTY_SLOT_OUTPUT_TRISTATE = I2S_FMTCFG_EMPTYSLOTOUTPUT_TRISTATE,
    } DL_I2S_EMPTY_SLOT_OUTPUT;

    /** @enum DL_I2S_WCLK_PHASE
     *  WCLK 分频比计算模式。
     */
    typedef enum
    {
        /*! Calculate WCLK division ratio for single phase operation *//*< 按单相位计算分频比 */
        DL_I2S_WCLK_PHASE_SINGLE = (0U << I2S_CLKCTL_WCLKPHASE_OFS),
        /*! Calculate WCLK division ratio for dual phase operation *//*< 按双相位计算分频比 */
        DL_I2S_WCLK_PHASE_DUAL = (1U << I2S_CLKCTL_WCLKPHASE_OFS),
        /*! Calculate user-defined custom WCLK division ratio *//*< 用户自定义分频比 */
        DL_I2S_WCLK_PHASE_CUSTOM = (2U << I2S_CLKCTL_WCLKPHASE_OFS),
    } DL_I2S_WCLK_PHASE;

    /** @enum DL_I2S_MODE
     *  I2S 工作模式。
     */
    typedef enum
    {
        /*! I2S controller mode. Module outputs audio clock signals (WCLK, BCLK) *//*< 控制器模式：模块输出时钟 */
        DL_I2S_MODE_CONTROLLER = 0U,
        /*! I2S target mode. Audio clock signals are inputs (WCLK, BCLK) *//*< 目标模式：时钟由外部输入 */
        DL_I2S_MODE_TARGET = 1U,
    } DL_I2S_MODE;

    /** @enum DL_I2S_DATA_PIN_DIRECTION
     *  数据引脚方向配置。
     */
    typedef enum
    {
        /*! Data pin not in use (disabled) *//*< 未使用（禁用） */
        DL_I2S_DATA_PIN_DIRECTION_UNUSED = 0U,
        /*! Data pin acts as input *//*< 输入 */
        DL_I2S_DATA_PIN_DIRECTION_INPUT = 1U,
        /*! Data pin acts as output *//*< 输出 */
        DL_I2S_DATA_PIN_DIRECTION_OUTPUT = 2U,
    } DL_I2S_DATA_PIN_DIRECTION;

    /** @enum DL_I2S_TX_FIFO_LEVEL
     *  TX FIFO 中断触发阈值。
     */
    typedef enum
    {
        /*! Trigger when the TX FIFO <= 3/4 empty *//*< 空闲 <= 3/4 时触发 */
        DL_I2S_TX_FIFO_LEVEL_3_4_EMPTY = I2S_IFLS_TXIFLSEL_LVL_3_4,
        /*! Trigger when TX FIFO <= 1/2 empty (default) *//*< 空闲 <= 1/2 时触发（默认） */
        DL_I2S_TX_FIFO_LEVEL_1_2_EMPTY = I2S_IFLS_TXIFLSEL_LVL_1_2,
        /*! Trigger when TX FIFO <= 1/4 empty *//*< 空闲 <= 1/4 时触发 */
        DL_I2S_TX_FIFO_LEVEL_1_4_EMPTY = I2S_IFLS_TXIFLSEL_LVL_1_4,
        /*! Trigger when TX FIFO is empty *//*< FIFO 完全空时触发 */
        DL_I2S_TX_FIFO_LEVEL_EMPTY = I2S_IFLS_TXIFLSEL_LVL_EMPTY,
        /*! Trigger when TX FIFO <= 1 *//*< 仅剩 1 个条目时触发 */
        DL_I2S_TX_FIFO_LEVEL_ONE_ENTRY = I2S_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY,
        /*! Trigger when TX FIFO >= (MAX_FIFO_LEN - 1) *//*< 接近满时触发 */
        DL_I2S_TX_FIFO_LEVEL_ALMOST_FULL = I2S_IFLS_TXIFLSEL_LVL_ALMOST_FULL,
    } DL_I2S_TX_FIFO_LEVEL;

    /** @enum DL_I2S_RX_FIFO_LEVEL
     *  RX FIFO 中断触发阈值。
     */
    typedef enum
    {
        /*! Trigger when RX FIFO >= 1/4 full *//*< 满 >= 1/4 时触发 */
        DL_I2S_RX_FIFO_LEVEL_1_4_FULL = I2S_IFLS_RXIFLSEL_LVL_1_4,
        /*! Trigger when RX FIFO >= 1/2 full (default) *//*< 满 >= 1/2 时触发（默认） */
        DL_I2S_RX_FIFO_LEVEL_1_2_FULL = I2S_IFLS_RXIFLSEL_LVL_1_2,
        /*! Trigger when RX FIFO >= 3/4 full *//*< 满 >= 3/4 时触发 */
        DL_I2S_RX_FIFO_LEVEL_3_4_FULL = I2S_IFLS_RXIFLSEL_LVL_3_4,
        /*! Trigger when RX FIFO is full *//*< FIFO 完全满时触发 */
        DL_I2S_RX_FIFO_LEVEL_FULL = I2S_IFLS_RXIFLSEL_LVL_FULL,
        /*! Trigger when RX FIFO >= (MAX_FIFO_LEN - 1) *//*< 接近满时触发 */
        DL_I2S_RX_FIFO_LEVEL_ALMOST_FULL = I2S_IFLS_RXIFLSEL_LVL_ALMOST_FULL,
        /*! Trigger when RX FIFO <= 1 *//*< 仅剩 1 个条目时触发 */
        DL_I2S_RX_FIFO_LEVEL_ONE_ENTRY = I2S_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY,
    } DL_I2S_RX_FIFO_LEVEL;

    /*! @enum DL_I2S_IIDX
     *  中断索引，标识最高优先级待处理中断类型。
     */
    typedef enum
    {
        /*! Interrupt index for I2S if no interrupt is pending *//*< 无中断 */
        DL_I2S_IIDX_NO_INT = I2S_IIDX_STAT_NO_INTR,
        /*! Interrupt index for I2S WCLK Error *//*< WCLK 错误 */
        DL_I2S_IIDX_WCLK_ERR = I2S_IIDX_STAT_WCLKERR,
        /*! Interrupt index for I2S Receive Interrupt *//*< 接收完成 */
        DL_I2S_IIDX_RX_DONE = I2S_IIDX_STAT_RXIFG,
        /*! Interrupt index for I2S Transmit Interrupt *//*< 发送完成 */
        DL_I2S_IIDX_TX_DONE = I2S_IIDX_STAT_TXIFG,
        /*! Interrupt index for I2S RXFIFO Overflow Event *//*< RXFIFO 溢出 */
        DL_I2S_IIDX_RXFIFO_OVERFLOW = I2S_IIDX_STAT_RXFIFO_OVF_EVT,
        /*! Interrupt index for I2S TXFIFO Underflow Event *//*< TXFIFO 下溢 */
        DL_I2S_IIDX_TXFIFO_UNDERFLOW = I2S_IIDX_STAT_TXFIFO_UNF_EVT,
        /*! Interrupt index for DMA Done on RX *//*< DMA 接收完成 */
        DL_I2S_IIDX_DMA_DONE_RX = I2S_IIDX_STAT_DMA_DONE_RX,
        /*! Interrupt index for DMA Done on TX *//*< DMA 发送完成 */
        DL_I2S_IIDX_DMA_DONE_TX = I2S_IIDX_STAT_DMA_DONE_TX,
    } DL_I2S_IIDX;

    /**
     * @brief  Configuration struct for @ref DL_I2S_setClockConfig.
     *         I2S 音频时钟配置结构体。
     */
    typedef struct
    {
        /*! I2S clock source. One of @ref DL_I2S_CLOCK_SOURCE *//*< I2S 主时钟源 */
        DL_I2S_CLOCK_SOURCE clockSel;
        /*! Audio clocks (WCLK, BCLK) source. One of @ref DL_I2S_WORD_BAUD_CLOCK_SOURCE *//*< 音频时钟来源 */
        DL_I2S_WORD_BAUD_CLOCK_SOURCE wordBaudClockSource;
        /*! WCLK phase. One of @ref DL_I2S_WCLK_PHASE *//*< WCLK 分频计算模式 */
        DL_I2S_WCLK_PHASE wclkPhase;
        /*! WCLK divide ratio. [0x1, 0xFFFF] *//*< WCLK 分频系数 */
        uint32_t wclkDivider;
        /*! BCLK divide ratio. [ @ref DL_I2S_BDIV_MINIMUM, @ref DL_I2S_BDIV_MAXIMUM] *//*< BCLK 分频系数 */
        uint32_t bclkDivider;
    } DL_I2S_ClockConfig;

    /**
     * @brief  Configuration struct for @ref DL_I2S_init.
     *         I2S 初始化配置结构体。
     */
    typedef struct
    {
        /*! Controller or target mode. One of @ref DL_I2S_MODE *//*< 工作模式 */
        DL_I2S_MODE mode;
        /*! WCLK inversion. One of @ref DL_I2S_WCLK_INVERSION *//*< WCLK 极性 */
        DL_I2S_WCLK_INVERSION wclkInvert;
        /*! Single or dual-phase. One of @ref DL_I2S_PHASE *//*< 帧相位格式 */
        DL_I2S_PHASE phase;
        /*! Positive or negative sampling edge. One of @ref DL_I2S_SAMPLE_EDGE *//*< 采样边沿 */
        DL_I2S_SAMPLE_EDGE samplingEdge;
        /*! Number of bits per sample word. [7, 31]. See @ref DL_I2S_setSampleWordLength *//*< 样本字长（位） */
        uint32_t sampleWordLength;
        /*! Data delay. One of @ref DL_I2S_DATA_DELAY *//*< 数据延迟 */
        DL_I2S_DATA_DELAY dataDelay;
        /*! Empty slot output. One of @ref DL_I2S_EMPTY_SLOT_OUTPUT *//*< 空时隙输出行为 */
        DL_I2S_EMPTY_SLOT_OUTPUT emptySlotOutput;
        /*! Memory access length. One of @ref DL_I2S_MEMORY_LENGTH *//*< 内存访问宽度 */
        DL_I2S_MEMORY_LENGTH memoryAccessLength;
        /*! Data pin 0 (AD0) direction. One of @ref DL_I2S_DATA_PIN_DIRECTION *//*< AD0 引脚方向 */
        DL_I2S_DATA_PIN_DIRECTION dataPin0Direction;
        /*! Valid channel mask for a frame on a data pin. [0, 0xFF] *//*< AD0 有效通道掩码 */
        uint32_t dataPin0ValidChannelMask;
#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
        /*! Data pin 1 (AD1) direction. One of @ref DL_I2S_DATA_PIN_DIRECTION *//*< AD1 引脚方向 */
        DL_I2S_DATA_PIN_DIRECTION dataPin1Direction;
        /*! Valid channel mask for a frame on a data pin. [0, 0xFF] *//*< AD1 有效通道掩码 */
        uint32_t dataPin1ValidChannelMask;
#endif
        /*! MCLK divide ratio. [ @ref DL_I2S_MDIV_MINIMUM, @ref DL_I2S_MDIV_MAXIMUM] *//*< MCLK 分频系数 */
        uint32_t mclkDivider;
        /*! Enable the optional MCLK signal. Controller mode only *//*< 是否使能 MCLK 输出（仅控制器模式） */
        bool enableMCLK;
    } DL_I2S_Config;

    /**
     *  @brief      Configure I2S audio clocks (WCLK and BCLK)
     *  @details    功能：配置 I2S 音频时钟源及 WCLK/BCLK 分频参数。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the
     *                      peripheral
     *                      参数：I2S 外设寄存器基址。
     *  @param[in]  config  Pointer to the clock configuration struct
     *                      @ref DL_I2S_ClockConfig.
     *                      参数：时钟配置结构体指针。
     *
     *  @return     返回值：无。
     */
    void DL_I2S_setClockConfig(I2S_Regs *i2s, const DL_I2S_ClockConfig *config);

    /**
     *  @brief      Get I2S audio clocks configuration (WCLK and BCLK)
     *  @details    功能：读取当前 I2S 音频时钟配置。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the
     *                      peripheral
     *                      参数：I2S 外设寄存器基址。
     *  @param[out] config  Pointer to the clock configuration struct
     *                      @ref DL_I2S_ClockConfig.
     *                      参数：用于接收配置的输出结构体指针。
     *
     *  @return     返回值：无。
     */
    void DL_I2S_getClockConfig(const I2S_Regs *i2s, DL_I2S_ClockConfig *config);

    /**
     *  @brief     Initialize the I2S peripheral
     *
     *  Initializes all the common configurable options for the I2S peripheral. Any
     *  other custom configuration can be done after calling this API. The I2S is
     *  not enabled in this API.
     *  中文说明：完成 I2S 关键参数初始化，但不在此接口内使能外设。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      参数：I2S 外设寄存器基址。
     *  @param[in]  config  Configuration for I2S peripheral
     *                      参数：I2S 初始化配置结构体。
     *
     *  @return     返回值：无。
     * @details    功能：参见上方英文说明。
     */
    void DL_I2S_init(I2S_Regs *i2s, const DL_I2S_Config *config);

    /**
     *  @brief      Writes 8-bit data into the TX FIFO for transmit
     *              向 TX FIFO 写入 8 位数据（不检查状态）。
     *
     *  Puts the data into the TX FIFO without checking its status. Use if already
     *  sure the TX FIFO has space for the write. See related APIs for additional
     *  transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    待发送 8 位数据。
     *
     *  @sa         DL_I2S_transmitDataBlocking8
     *  @sa         DL_I2S_transmitDataCheck8
     */
    __STATIC_INLINE void DL_I2S_transmitData8(I2S_Regs *i2s, uint8_t data)
    {
        i2s->TXDATA = data; // 写入 TX FIFO
    }

    /**
     *  @brief      Writes 16-bit data into the TX FIFO for transmit
     *              向 TX FIFO 写入 16 位数据（不检查状态）。
     *
     *  Puts the data into the TX FIFO without checking its status. Use if already
     *  sure the TX FIFO has space for the write. See related APIs for additional
     *  transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    待发送 16 位数据。
     *
     *  @sa         DL_I2S_transmitDataBlocking16
     *  @sa         DL_I2S_transmitDataCheck16
     */
    __STATIC_INLINE void DL_I2S_transmitData16(I2S_Regs *i2s, uint16_t data)
    {
        i2s->TXDATA = data; // 写入 TX FIFO
    }

    /**
     *  @brief      Writes 32-bit data into the TX FIFO for transmit
     *              向 TX FIFO 写入 32 位数据（不检查状态）。
     *
     *  Puts the data into the TX FIFO without checking its status. Use if already
     *  sure the TX FIFO has space for the write. See related APIs for additional
     *  transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *
     *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
     *  choose to pack two 16-bit frames into one word.
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    待发送 32 位数据。
     *
     *  @sa         DL_I2S_transmitDataBlocking32
     *  @sa         DL_I2S_transmitDataCheck32
     */
    __STATIC_INLINE void DL_I2S_transmitData32(I2S_Regs *i2s, uint32_t data)
    {
        i2s->TXDATA = data; // 写入 TX FIFO
    }

    /**
     *  @brief      Reads 8-bit data from the RX FIFO
     *              从 RX FIFO 读取 8 位数据（不检查状态）。
     *
     *  Reads the data from the RX FIFO without checking its status. Use if
     *  already sure the RX FIFO has data available. See related APIs for
     *  additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    I2S 外设寄存器基址。
     *
     *  @return     The data in the RX FIFO
     *              读取到的 8 位样本。
     *
     *  @sa         DL_I2S_receiveDataBlocking8
     *  @sa         DL_I2S_receiveDataCheck8
     */
    __STATIC_INLINE uint8_t DL_I2S_receiveData8(const I2S_Regs *i2s)
    {
        return ((uint8_t)(i2s->RXDATA)); // 从 RX FIFO 读取
    }

    /**
     *  @brief      Reads 16-bit data from the RX FIFO
     *              从 RX FIFO 读取 16 位数据（不检查状态）。
     *
     *  Reads the data from the RX FIFO without checking its status. Use if
     *  already sure the RX FIFO has data available. See related APIs for
     *  additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    I2S 外设寄存器基址。
     *
     *  @return     The data in the RX FIFO
     *              读取到的 16 位样本。
     *
     *  @sa         DL_I2S_receiveDataBlocking16
     *  @sa         DL_I2S_receiveDataCheck16
     */
    __STATIC_INLINE uint16_t DL_I2S_receiveData16(const I2S_Regs *i2s)
    {
        return ((uint16_t)(i2s->RXDATA)); // 从 RX FIFO 读取
    }

    /**
     *  @brief      Reads 32-bit data from the RX FIFO
     *              从 RX FIFO 读取 32 位数据（不检查状态）。
     *
     *  Reads the data from the RX FIFO without checking its status. Use if
     *  already sure the RX FIFO has data available. See related APIs for
     *  additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    I2S 外设寄存器基址。
     *
     *  @return     The data in the RX FIFO
     *              读取到的 32 位样本。
     *
     *  @sa         DL_I2S_receiveDataBlocking32
     *  @sa         DL_I2S_receiveDataCheck32
     */
    __STATIC_INLINE uint32_t DL_I2S_receiveData32(const I2S_Regs *i2s)
    {
        return (i2s->RXDATA); // 从 RX FIFO 读取
    }

    /**
     *  @brief      Blocks to ensure transmit is ready before sending data
     *
     *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
     *  full. Will wait indefinitely until there is space in the TX FIFO. See
     *  related APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *  中文说明：阻塞等待 TX FIFO 可写后发送 8 位数据。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    参数：待发送 8 位样本。
     *
     *  @return     返回值：无。
     *
     *  @sa         DL_I2S_transmitData8
     *  @sa         DL_I2S_transmitDataCheck8
     * @details    功能：参见上方英文说明。
     */
    void DL_I2S_transmitDataBlocking8(I2S_Regs *i2s, uint8_t data);

    /**
     *  @brief      Blocks to ensure transmit is ready before sending data
     *
     *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
     *  full. Will wait indefinitely until there is space in the TX FIFO. See
     *  related APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *  中文说明：阻塞等待 TX FIFO 可写后发送 16 位数据。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    参数：待发送 16 位样本。
     *
     *  @return     返回值：无。
     *
     *  @sa         DL_I2S_transmitData16
     *  @sa         DL_I2S_transmitDataCheck16
     * @details    功能：参见上方英文说明。
     */
    void DL_I2S_transmitDataBlocking16(I2S_Regs *i2s, uint16_t data);

    /**
     *  @brief      Blocks to ensure transmit is ready before sending data
     *
     *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
     *  full. Will wait indefinitely until there is space in the TX FIFO. See
     *  related APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *
     *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
     *  choose to pack two 16-bit frames into one word.
     *  中文说明：阻塞等待 TX FIFO 可写后发送 32 位数据。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    参数：待发送 32 位样本。
     *
     *  @return     返回值：无。
     *
     *  @sa         DL_I2S_transmitData32
     *  @sa         DL_I2S_transmitDataCheck32
     * @details    功能：参见上方英文说明。
     */
    void DL_I2S_transmitDataBlocking32(I2S_Regs *i2s, uint32_t data);

    /**
     *  @brief      Blocks to ensure receive is ready before reading data
     *
     *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
     *  empty. Will wait indefinitely until there is data in the RX FIFO. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *  中文说明：阻塞等待 RX FIFO 有数据后读取 8 位样本。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *
     *  @return     The data in the RX FIFO
     *              返回值：读取到的 8 位样本。
     *
     *  @sa         DL_I2S_receiveData16
     *  @sa         DL_I2S_receiveDataCheck16
     * @details    功能：参见上方英文说明。
     */
    uint8_t DL_I2S_receiveDataBlocking8(const I2S_Regs *i2s);

    /**
     *  @brief      Blocks to ensure receive is ready before reading data
     *
     *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
     *  empty. Will wait indefinitely until there is data in the RX FIFO. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *  中文说明：阻塞等待 RX FIFO 有数据后读取 16 位样本。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *
     *  @return     The data in the RX FIFO
     *              返回值：读取到的 16 位样本。
     *
     *  @sa         DL_I2S_receiveData16
     *  @sa         DL_I2S_receiveDataCheck16
     * @details    功能：参见上方英文说明。
     */
    uint16_t DL_I2S_receiveDataBlocking16(const I2S_Regs *i2s);

    /**
     *  @brief      Blocks to ensure receive is ready before reading data
     *
     *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
     *  empty. Will wait indefinitely until there is data in the RX FIFO. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *  中文说明：阻塞等待 RX FIFO 有数据后读取 32 位样本。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *
     *  @return     The data in the RX FIFO
     *              返回值：读取到的 32 位样本。
     *
     *  @sa         DL_I2S_receiveData32
     *  @sa         DL_I2S_receiveDataCheck32
     * @details    功能：参见上方英文说明。
     */
    uint32_t DL_I2S_receiveDataBlocking32(const I2S_Regs *i2s);

    /**
     *  @brief      Checks the TX FIFO before trying to transmit data
     *
     *  Checks if the TX FIFO is already full before trying to add new data to the
     *  FIFO. Exits immediately if full rather than trying to block. See related
     *  APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *  中文说明：非阻塞发送 8 位数据，FIFO 满时立即返回。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    参数：待发送 8 位样本。
     *
     *  @return     If the transmit occurred
     *
     *  @retval     true  if data was added to the TX FIFO
     *  @retval     false if the TX FIFO was full and data was not added
     *              返回值：`true` 成功写入，`false` 表示 FIFO 满。
     *
     *  @sa         DL_I2S_transmitData8
     *  @sa         DL_I2S_transmitDataBlocking8
     * @details    功能：参见上方英文说明。
     */
    bool DL_I2S_transmitDataCheck8(I2S_Regs *i2s, uint8_t data);

