zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2s.h
    /**
     *  @brief      Checks the TX FIFO before trying to transmit data
     *
     *  Checks if the TX FIFO is already full before trying to add new data to the
     *  FIFO. Exits immediately if full rather than trying to block. See related
     *  APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *  中文说明：非阻塞发送 16 位数据，FIFO 满时立即返回。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    参数：待发送 16 位样本。
     *
     *  @return     If the transmit occurred
     *
     *  @retval     true  if data was added to the TX FIFO
     *  @retval     false if the TX FIFO was full and data was not added
     *              返回值：`true` 成功写入，`false` 表示 FIFO 满。
     *
     *  @sa         DL_I2S_transmitData16
     *  @sa         DL_I2S_transmitDataBlocking16
     * @details    功能：参见上方英文说明。
     */
    bool DL_I2S_transmitDataCheck16(I2S_Regs *i2s, uint16_t data);

    /**
     *  @brief      Checks the TX FIFO before trying to transmit data
     *
     *  Checks if the TX FIFO is already full before trying to add new data to the
     *  FIFO. Exits immediately if full rather than trying to block. See related
     *  APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *
     *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
     *  choose to pack two 16-bit frames into one word.
     *  中文说明：非阻塞发送 32 位数据，FIFO 满时立即返回。
     *
     *  @param[in]  i2s   pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *  @param[in]  data  data to send
     *                    参数：待发送 32 位样本。
     *
     *  @return     If the transmit occurred
     *
     *  @retval     true  if data was added to the TX FIFO
     *  @retval     false if the TX FIFO was full and data was not added
     *              返回值：`true` 成功写入，`false` 表示 FIFO 满。
     *
     *  @sa         DL_I2S_transmitData32
     *  @sa         DL_I2S_transmitDataBlocking32
     * @details    功能：参见上方英文说明。
     */
    bool DL_I2S_transmitDataCheck32(I2S_Regs *i2s, uint32_t data);

    /**
     *  @brief      Checks the RX FIFO before trying to receive data
     *
     *  Checks if the RX FIFO is already empty before trying to read new data from
     *  the FIFO. Exits immediately if empty rather than trying to block. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *  中文说明：非阻塞读取 8 位数据，FIFO 空时立即返回。
     *
     *  @param[in]  i2s    pointer to the register overlay for the peripheral
     *                     参数：I2S 外设寄存器基址。
     *  @param[out]  buffer a buffer to write the received data into
     *                      参数：接收输出缓冲区。
     *
     *  @return     If the receive occurred
     *
     *  @retval     true  if data was read from the RX FIFO
     *  @retval     false if the RX FIFO was empty and data was not read
     *              返回值：`true` 读取成功，`false` 表示 FIFO 空。
     *
     *  @sa         DL_I2S_receiveData8
     *  @sa         DL_I2S_receiveDataBlocking8
     * @details    功能：参见上方英文说明。
     */
    bool DL_I2S_receiveDataCheck8(const I2S_Regs *i2s, uint8_t *buffer);

    /**
     *  @brief      Checks the RX FIFO before trying to receive data
     *
     *  Checks if the RX FIFO is already empty before trying to read new data from
     *  the FIFO. Exits immediately if empty rather than trying to block. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *  中文说明：非阻塞读取 16 位数据，FIFO 空时立即返回。
     *
     *  @param[in]  i2s    pointer to the register overlay for the peripheral
     *                     参数：I2S 外设寄存器基址。
     *  @param[out]  buffer a buffer to write the received data into
     *                      参数：接收输出缓冲区。
     *
     *  @return     If the receive occurred
     *
     *  @retval     true  if data was read from the RX FIFO
     *  @retval     false if the RX FIFO was empty and data was not read
     *              返回值：`true` 读取成功，`false` 表示 FIFO 空。
     *
     *  @sa         DL_I2S_receiveData16
     *  @sa         DL_I2S_receiveDataBlocking16
     * @details    功能：参见上方英文说明。
     */
    bool DL_I2S_receiveDataCheck16(const I2S_Regs *i2s, uint16_t *buffer);

    /**
     *  @brief      Checks the RX FIFO before trying to receive data
     *
     *  Checks if the RX FIFO is already empty before trying to read new data from
     *  the FIFO. Exits immediately if empty rather than trying to block. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *  中文说明：非阻塞读取 32 位数据，FIFO 空时立即返回。
     *
     *  @param[in]  i2s    pointer to the register overlay for the peripheral
     *                     参数：I2S 外设寄存器基址。
     *  @param[out]  buffer a buffer to write the received data into
     *                      参数：接收输出缓冲区。
     *
     *  @return     If the receive occurred
     *
     *  @retval     true  if data was read from the RX FIFO
     *  @retval     false if the RX FIFO was empty and data was not read
     *              返回值：`true` 读取成功，`false` 表示 FIFO 空。
     *
     *  @sa         DL_I2S_receiveData32
     *  @sa         DL_I2S_receiveDataBlocking32
     * @details    功能：参见上方英文说明。
     */
    bool DL_I2S_receiveDataCheck32(const I2S_Regs *i2s, uint32_t *buffer);

    /**
     *  @brief       Read all available data out of the RX FIFO using 8 bit access
     *  @details     功能：批量读取 RX FIFO 中可用的 8 位数据。
     *
     *  @param[in]   i2s       Pointer to the register overlay for the peripheral
     *                         参数：I2S 外设寄存器基址。
     *  @param[out]  buffer    Buffer to write received data into
     *                         参数：接收缓冲区。
     *  @param[in]   maxCount  Max number of halfwords to read from the RX FIFO
     *                         参数：最大读取数量。
     *
     *  @return      Number of bytes read from the RX FIFO
     *               返回值：实际读取的字节数。
     */
    uint32_t DL_I2S_drainRXFIFO8(
        const I2S_Regs *i2s, uint8_t *buffer, uint32_t maxCount);

    /**
     *  @brief       Read all available data out of the RX FIFO using 16 bit access
     *  @details     功能：批量读取 RX FIFO 中可用的 16 位数据。
     *
     *  @param[in]   i2s       Pointer to the register overlay for the peripheral
     *                         参数：I2S 外设寄存器基址。
     *  @param[out]  buffer    Buffer to write received data into
     *                         参数：接收缓冲区。
     *  @param[in]   maxCount  Max number of halfwords to read from the RX FIFO
     *                         参数：最大读取数量。
     *
     *  @return      Number of halfwords read from the RX FIFO
     *               返回值：实际读取的半字数。
     */
    uint32_t DL_I2S_drainRXFIFO16(
        const I2S_Regs *i2s, uint16_t *buffer, uint32_t maxCount);

    /**
     *  @brief       Read all available data out of the RX FIFO using 32 bit access
     *
     *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
     *  choose to pack two 16-bit frames into one word.
     *  中文说明：批量读取 RX FIFO 中可用的 32 位数据。
     *
     *  @param[in]   i2s       Pointer to the register overlay for the peripheral
     *                         参数：I2S 外设寄存器基址。
     *  @param[out]  buffer    Buffer to write received data into
     *                         参数：接收缓冲区。
     *  @param[in]   maxCount  Max number of words to read from the RX FIFO
     *                         参数：最大读取数量。
     *
     *  @return      Number of words read from the RX FIFO
     *               返回值：实际读取的字数。
     * @details    功能：参见上方英文说明。
     */
    uint32_t DL_I2S_drainRXFIFO32(
        const I2S_Regs *i2s, uint32_t *buffer, uint32_t maxCount);

    /**
     *  @brief      Fill the TX FIFO using 8 bit access
     *
     *  Continuously write data into the TX FIFO until it is filled up or count has
     *  been reached.
     *  中文说明：批量写入 8 位数据到 TX FIFO，直到 FIFO 满或达到上限。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                     参数：I2S 外设寄存器基址。
     *  @param[in]  buffer  Buffer of data to write to the TX FIFO
     *                     参数：发送缓冲区。
     *  @param[in]  count   Max number of halfwords to write to the TX FIFO
     *                     参数：最大写入数量。
     *
     *  @return     Number of bytes written to the TX FIFO
     *              返回值：实际写入的字节数。
     * @details    功能：参见上方英文说明。
     */
    uint32_t DL_I2S_fillTXFIFO8(
        I2S_Regs *i2s, const uint8_t *buffer, uint32_t count);

    /**
     *  @brief      Fill the TX FIFO using 16 bit access
     *
     *  Continuously write data into the TX FIFO until it is filled up or count has
     *  been reached.
     *  中文说明：批量写入 16 位数据到 TX FIFO，直到 FIFO 满或达到上限。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                     参数：I2S 外设寄存器基址。
     *  @param[in]  buffer  Buffer of data to write to the TX FIFO
     *                     参数：发送缓冲区。
     *  @param[in]  count   Max number of halfwords to write to the TX FIFO
     *                     参数：最大写入数量。
     *
     *  @return     Number of halfwords written to the TX FIFO
     *              返回值：实际写入的半字数。
     * @details    功能：参见上方英文说明。
     */
    uint32_t DL_I2S_fillTXFIFO16(
        I2S_Regs *i2s, const uint16_t *buffer, uint32_t count);

    /**
     *  @brief      Fill the TX FIFO using 32 bit access
     *
     *  Continuously write data into the TX FIFO until it is filled up or count has
     *  been reached.
     *
     *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
     *  choose to pack two 16-bit frames into one word.
     *  中文说明：批量写入 32 位数据到 TX FIFO，直到 FIFO 满或达到上限。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                     参数：I2S 外设寄存器基址。
     *  @param[in]  buffer  Buffer of data to write to the TX FIFO
     *                     参数：发送缓冲区。
     *  @param[in]  count   Max number of words to write to the TX FIFO
     *                     参数：最大写入数量。
     *
     *  @return     Number of words written to the TX FIFO
     *              返回值：实际写入的字数。
     * @details    功能：参见上方英文说明。
     */
    uint32_t DL_I2S_fillTXFIFO32(
        I2S_Regs *i2s, const uint32_t *buffer, uint32_t count);

    /**
     *  @brief      Clears contents of TX FIFO
     *
     *  @note When a FIFO clear has been initiated, do not try to re-clear again.
     *  中文说明：触发 TX FIFO 清空并等待硬件完成。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   参数：I2S 外设寄存器基址。
     *
     *  @return     返回值：无。
     * @details    功能：参见上方英文说明。
     */
    void DL_I2S_clearTXFIFO(I2S_Regs *i2s);

    /**
     *  @brief      Clears contents of RX FIFO
     *
     *  @note When a FIFO clear has been initiated, do not try to re-clear again.
     *  中文说明：触发 RX FIFO 清空并等待硬件完成。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   参数：I2S 外设寄存器基址。
     *
     *  @return     返回值：无。
     * @details    功能：参见上方英文说明。
     */
    void DL_I2S_clearRXFIFO(I2S_Regs *i2s);

    /**
     *  @brief      Checks if TX FIFO is full
     *              检查 TX FIFO 是否已满。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     If TX FIFO is full
     *              TX FIFO 是否已满。
     *
     *  @retval     true if TX FIFO is full
     *  @retval     false if TX FIFO is not full
     */
    __STATIC_INLINE bool DL_I2S_isTXFIFOFull(const I2S_Regs *i2s)
    {
        return ((i2s->STAT & I2S_STAT_TXFF_MASK) == I2S_STAT_TXFF_SET);
    }

    /**
     *  @brief      Checks if TX FIFO is empty
     *              检查 TX FIFO 是否为空。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     If TX FIFO is empty
     *              TX FIFO 是否为空。
     *
     *  @retval     true if TX FIFO is empty
     *  @retval     false if TX FIFO is not empty
     */
    __STATIC_INLINE bool DL_I2S_isTXFIFOEmpty(const I2S_Regs *i2s)
    {
        return ((i2s->STAT & I2S_STAT_TXFE_MASK) == I2S_STAT_TXFE_SET);
    }

    /**
     *  @brief      Checks if RX FIFO is full
     *              检查 RX FIFO 是否已满。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     If RX FIFO is full
     *              RX FIFO 是否已满。
     *
     *  @retval     true if RX FIFO is full
     *  @retval     false if RX FIFO is not full
     */
    __STATIC_INLINE bool DL_I2S_isRXFIFOFull(const I2S_Regs *i2s)
    {
        return ((i2s->STAT & I2S_STAT_RXFF_MASK) == I2S_STAT_RXFF_SET);
    }

    /**
     *  @brief      Checks if RX FIFO is empty
     *              检查 RX FIFO 是否为空。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     If RX FIFO is empty
     *              RX FIFO 是否为空。
     *
     *  @retval     true if RX FIFO is empty
     *  @retval     false if RX FIFO is not empty
     */
    __STATIC_INLINE bool DL_I2S_isRXFIFOEmpty(const I2S_Regs *i2s)
    {
        return ((i2s->STAT & I2S_STAT_RXFE_MASK) == I2S_STAT_RXFE_SET);
    }

    /**
     * @brief Enables the Peripheral Write Enable (PWREN) register for the I2S
     *        使能 I2S 外设电源写入寄存器。
     *
     *  Before any peripheral registers can be configured by software, the
     *  peripheral itself must be enabled by writing the ENABLE bit together with
     *  the appropriate KEY value to the peripheral's PWREN register.
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_enablePower(I2S_Regs *i2s)
    {
        i2s->GPRCM.PWREN = (I2S_PWREN_KEY_UNLOCK_W | I2S_PWREN_ENABLE_ENABLE);
    }

    /**
     * @brief Disables the Peripheral Write Enable (PWREN) register for the I2S
     *        禁用 I2S 外设电源写入寄存器。
     *
     *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
     *  accessible for read/write operations.
     *
     *  @note This API does not provide large power savings. For power savings,
     *  please refer to @ref DL_I2S_enable
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_disablePower(I2S_Regs *i2s)
    {
        i2s->GPRCM.PWREN = (I2S_PWREN_KEY_UNLOCK_W | I2S_PWREN_ENABLE_DISABLE);
    }

    /**
     * @brief Returns if the Peripheral Write Enable (PWREN) register for the I2S
     *        is enabled
     *        查询 I2S 外设电源是否已使能。
     *
     *  Before any peripheral registers can be configured by software, the
     *  peripheral itself must be enabled by writing the ENABLE bit together with
     *  the appropriate KEY value to the peripheral's PWREN register.
     *
     *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
     *  accessible for read/write operations.
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     Whether power is enabled
     *              电源是否已使能。
     *
     *  @retval     true if peripheral register access is enabled
     *  @retval     false if peripheral register access is disabled
     */
    __STATIC_INLINE bool DL_I2S_isPowerEnabled(const I2S_Regs *i2s)
    {
        return (
            (i2s->GPRCM.PWREN & I2S_PWREN_ENABLE_MASK) == I2S_PWREN_ENABLE_ENABLE);
    }

    /**
     * @brief Resets I2S peripheral
     *        复位 I2S 外设。
     *
     * @param i2s        Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_reset(I2S_Regs *i2s)
    {
        i2s->GPRCM.RSTCTL =
            (I2S_RSTCTL_KEY_UNLOCK_W | I2S_RSTCTL_RESETSTKYCLR_CLR |
             I2S_RSTCTL_RESETASSERT_ASSERT);
    }

    /**
     * @brief Returns if I2S peripheral was reset
     *        查询 I2S 外设是否已复位。
     *
     * @param i2s        Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @return     Whether module was reset
     *              外设是否已复位。
     *
     *  @retval     true if module was reset
     *  @retval     false if module wasn't reset
     */
    __STATIC_INLINE bool DL_I2S_isReset(const I2S_Regs *i2s)
    {
        return ((i2s->GPRCM.STAT & I2S_GPRCM_STAT_RESETSTKY_MASK) ==
                I2S_GPRCM_STAT_RESETSTKY_RESET);
    }

    /**
     *  @brief      Enable the I2S peripheral
     *              使能 I2S 外设。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_enable(I2S_Regs *i2s)
    {
        i2s->FMTCFG |= I2S_FMTCFG_ENABLE_ENABLE;
    }

    /**
     *  @brief      Disable the I2S peripheral
     *              禁用 I2S 外设。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_disable(I2S_Regs *i2s)
    {
        i2s->FMTCFG &= ~(I2S_FMTCFG_ENABLE_MASK);
    }

    /**
     *  @brief      Checks if the I2S peripheral is enabled
     *              查询 I2S 外设是否已使能。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @return     Returns the enabled status of the I2S
     *              I2S 使能状态。
     *
     *  @retval     true  The I2S peripheral is enabled
     *  @retval     false The I2S peripheral is disabled
     */
    __STATIC_INLINE bool DL_I2S_isEnabled(const I2S_Regs *i2s)
    {
        return (
            (i2s->FMTCFG & I2S_FMTCFG_ENABLE_MASK) == I2S_FMTCFG_ENABLE_ENABLE);
    }

    /**
     *  @brief      Enable free run control
     *              使能自由运行模式，CPU 暂停调试时模块继续运行。
     *
     *  When enabled, the module will continue to free run and ignores the state
     *  of the CPU halted debug state
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_enableFreeRun(I2S_Regs *i2s)
    {
        DL_Common_updateReg(
            &i2s->PDBGCTL, I2S_PDBGCTL_FREE_RUN, I2S_PDBGCTL_FREE_MASK);
    }

    /**
     *  @brief      Disable free run control
     *              禁用自由运行模式。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_disableFreeRun(I2S_Regs *i2s)
    {
        DL_Common_updateReg(
            &i2s->PDBGCTL, I2S_PDBGCTL_FREE_STOP, I2S_PDBGCTL_FREE_MASK);
    }

    /**
     *  @brief      Returns if free run control is enabled
     *              查询自由运行模式是否已使能。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @return     Whether free run is enabled
     *              自由运行是否已使能。
     *
     *  @retval     true if free run is enabled
     *  @retval     false if free run is disabled
     */
    __STATIC_INLINE bool DL_I2S_isFreeRunEnabled(const I2S_Regs *i2s)
    {
        return ((i2s->PDBGCTL & I2S_PDBGCTL_FREE_MASK) == I2S_PDBGCTL_FREE_RUN);
    }

    /**
     *  @brief      Get the current mode for the I2S (controller/target)
     *  @details    功能：读取 I2S 当前工作模式（控制器/目标）。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      参数：I2S 外设寄存器基址。
     *
     *  @return     The currently configured mode for I2S (controller/target)
     *              返回值：当前 I2S 模式。
     *
     *  @retval     One of @ref DL_I2S_MODE
     */
    DL_I2S_MODE DL_I2S_getMode(const I2S_Regs *i2s);

    /**
     *  @brief      Set whether the device should be in controller/target mode
     *  @details    功能：设置 I2S 为控制器模式或目标模式。
     *
     *  @param[in]  i2s   Pointer to the register overlay for the peripheral
     *                    参数：I2S 外设寄存器基址。
     *  @param[in]  mode  Mode to configure the I2S into. One of @ref DL_I2S_MODE
     *                    参数：目标模式配置。
     *
     *  @return     返回值：无。
     *
     *  @sa DL_I2S_init
     */
    void DL_I2S_setMode(I2S_Regs *i2s, DL_I2S_MODE mode);

    /**
     *  @brief      Enable WCLK and BCLK generation
     *              使能 WCLK 和 BCLK 时钟输出（控制器模式）。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_enableWBCLKGeneration(I2S_Regs *i2s)
    {
        i2s->CLKCTL |= I2S_CLKCTL_WBEN_EN;
    }

    /**
     *  @brief      Disable WCLK and BCLK generation
     *              禁用 WCLK 和 BCLK 时钟输出。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_disableWBCLKGeneration(I2S_Regs *i2s)
    {
        i2s->CLKCTL &= ~(I2S_CLKCTL_WBEN_MASK);
    }

    /**
     *  @brief      Returns if WCLK and BCLK generation is enabled
     *              查询 WCLK/BCLK 时钟输出是否已使能。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @return     Whether clock generation is enabled
     *              时钟输出是否已使能。
     *
     *  @retval     true if clock generation is enabled
     *  @retval     false if clock generation is disabled
     *
     */
    __STATIC_INLINE bool DL_I2S_isWBCLKGenerationEnabled(const I2S_Regs *i2s)
    {
        return ((i2s->CLKCTL & I2S_CLKCTL_WBEN_MASK) == I2S_CLKCTL_WBEN_EN);
    }

    /**
     *  @brief Enable MCLK generation
     *         使能 MCLK 时钟输出（仅控制器模式）。
     *
     *  MCLK only applies when I2S is operating in controller mode. MCLK is an
     *  optional clock output signal
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @sa DL_I2S_init
     *  @sa DL_I2S_setMode
     */
    __STATIC_INLINE void DL_I2S_enableMCLKGeneration(I2S_Regs *i2s)
    {
        i2s->CLKCTL |= I2S_CLKCTL_MEN_EN;
    }

    /**
     *  @brief      Disable MCLK generation
     *              禁用 MCLK 时钟输出。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2S_disableMCLKGeneration(I2S_Regs *i2s)
    {
        i2s->CLKCTL &= ~(I2S_CLKCTL_MEN_MASK);
    }

    /**
     *  @brief      Returns if MCLK generation is enabled
     *              查询 MCLK 时钟输出是否已使能。
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @return     Whether clock generation is enabled
     *              时钟输出是否已使能。
     *
     *  @retval     true if clock generation is enabled
     *  @retval     false if clock generation is disabled
     */
    __STATIC_INLINE bool DL_I2S_isMCLKGenerationEnabled(const I2S_Regs *i2s)
    {
        return ((i2s->CLKCTL & I2S_CLKCTL_MEN_MASK) == I2S_CLKCTL_MEN_EN);
    }

