zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2s.h
    /**
     *  @brief      Get source of WCLK and BCLK
     *              获取 WCLK/BCLK 音频时钟源。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     Source of WCLK and BCLK
     *              当前音频时钟源。
     *
     *  @retval     One of @ref DL_I2S_WORD_BAUD_CLOCK_SOURCE
     */
    __STATIC_INLINE DL_I2S_WORD_BAUD_CLOCK_SOURCE DL_I2S_getWBCLKSource(
        const I2S_Regs *i2s)
    {
        uint32_t clockSource = i2s->WCLKSRC & I2S_WCLKSRC_WBCLKSRC_MASK;

        return (DL_I2S_WORD_BAUD_CLOCK_SOURCE)(clockSource);
    }

    /**
     *  @brief      Set source of WCLK and BCLK
     *              设置 WCLK/BCLK 音频时钟源。
     *
     *  @param[in]  i2s         Pointer to the register overlay for the peripheral
     *                          I2S 外设寄存器基址。
     *
     *  @param[in]  clockSource Source of WCLK and BCLK.
     *                          One of @ref DL_I2S_WORD_BAUD_CLOCK_SOURCE.
     *                          音频时钟源选择。
     */
    __STATIC_INLINE void DL_I2S_setWBCLKSource(
        I2S_Regs *i2s, DL_I2S_WORD_BAUD_CLOCK_SOURCE clockSource)
    {
        DL_Common_updateReg(
            &i2s->WCLKSRC, (uint32_t)clockSource, I2S_WCLKSRC_WBCLKSRC_MASK);
    }

    /**
     *  @brief      Get WCLK inversion status
     *              获取 WCLK 极性反转状态。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     WCLK inversion status
     *              WCLK 极性反转状态。
     *
     *  @retval     One of @ref DL_I2S_WCLK_INVERSION
     */
    __STATIC_INLINE DL_I2S_WCLK_INVERSION DL_I2S_getWCLKInversion(
        const I2S_Regs *i2s)
    {
        uint32_t wclkInversion = i2s->WCLKSRC & I2S_WCLKSRC_WCLKINV_MASK;

        return (DL_I2S_WCLK_INVERSION)(wclkInversion);
    }

    /**
     *  @brief      Invert WCLK
     *              设置 WCLK 极性反转。
     *
     *  @param[in]  i2s           Pointer to the register overlay for the peripheral
     *                            I2S 外设寄存器基址。
     *
     *  @param[in]  wclkInversion WCLK inversion status.
     *                            One of @ref DL_I2S_WCLK_INVERSION.
     *                            WCLK 极性反转配置。
     */
    __STATIC_INLINE void DL_I2S_setWCLKInversion(
        I2S_Regs *i2s, DL_I2S_WCLK_INVERSION wclkInversion)
    {
        DL_Common_updateReg(
            &i2s->WCLKSRC, (uint32_t)wclkInversion, I2S_WCLKSRC_WCLKINV_MASK);
    }

    /**
     *  @brief      Get WCLK phase
     *              获取 WCLK 分频比计算模式。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     WCLK phase
     *              WCLK 分频比计算模式。
     *
     *  @retval     One of @ref DL_I2S_WCLK_PHASE
     */
    __STATIC_INLINE DL_I2S_WCLK_PHASE DL_I2S_getWCLKPhase(const I2S_Regs *i2s)
    {
        uint32_t wclkPhase = i2s->CLKCTL & I2S_CLKCTL_WCLKPHASE_MASK;

        return (DL_I2S_WCLK_PHASE)(wclkPhase);
    }

    /**
     *  @brief      Set WCLK phase
     *              设置 WCLK 分频比计算模式。
     *
     *  @param[in]  i2s         Pointer to the register overlay for the peripheral
     *                          I2S 外设寄存器基址。
     *
     *  @param[in]  wclkPhase   WCLK phase. One of @ref DL_I2S_WCLK_PHASE.
     *                          WCLK 分频比计算模式。
     */
    __STATIC_INLINE void DL_I2S_setWCLKPhase(
        I2S_Regs *i2s, DL_I2S_WCLK_PHASE wclkPhase)
    {
        DL_Common_updateReg(
            &i2s->CLKCTL, (uint32_t)wclkPhase, I2S_CLKCTL_WCLKPHASE_MASK);
    }

    /**
     *  @brief Set MCLK divider
     *         设置 MCLK 分频系数。
     *
     *  @param[in]  i2s                     Pointer to the register overlay for the
     *                                      peripheral
     *                                      I2S 外设寄存器基址。
     *  @param[in]  mclkDivider             MCLK divider.
     *  [ @ref DL_I2S_MDIV_MINIMUM, @ref DL_I2S_MDIV_MAXIMUM ]
     *                                      MCLK 分频系数。
     *
     *  @sa         @ref DL_I2S_MDIV_INVALID
     */
    __STATIC_INLINE void DL_I2S_setMCLKDivider(I2S_Regs *i2s, uint32_t mclkDivider)
    {
        DL_Common_updateReg(&i2s->MCLKDIV, mclkDivider, I2S_MCLKDIV_MDIV_MASK);
    }

    /**
     *  @brief      Get MCLK divider
     *              获取 MCLK 分频系数。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     MCLK divider
     *              MCLK 分频系数。
     *
     *  @retval     [ @ref DL_I2S_MDIV_MINIMUM, @ref DL_I2S_MDIV_MAXIMUM ]
     *
     *  @sa         @ref DL_I2S_MDIV_INVALID
     */
    __STATIC_INLINE uint32_t DL_I2S_getMCLKDivider(const I2S_Regs *i2s)
    {
        uint32_t mclkDivider = i2s->MCLKDIV & I2S_MCLKDIV_MDIV_MASK;

        return (mclkDivider);
    }

    /**
     *  @brief Set WCLK divider.
     *         设置 WCLK 分频系数。
     *
     *  @note For single-phase and dual-phase frame formats, WDIV[9:0] are used for
     *  the clock calcuation, making 1023 the maximum factor of the division ratio.
     *  @note For user-defined frame formats such as PCM (long) and TDM formats,
     *  WCLK is high for WDIV[7:0] and low for WDIV[15:8], making both high and low
     *  portions have a maximum factor of 255.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the
     *                             peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  wclkDivider    WCLK divider to set. [0x1, 0xFFFF]
     *                             WCLK 分频系数。
     */
    __STATIC_INLINE void DL_I2S_setWCLKDivider(I2S_Regs *i2s, uint32_t wclkDivider)
    {
        DL_Common_updateReg(&i2s->WCLKDIV, wclkDivider, I2S_WCLKDIV_WDIV_MASK);
    }

    /**
     *  @brief      Get WCLK divider
     *              获取 WCLK 分频系数。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     WCLK divider
     *              WCLK 分频系数。
     *
     *  @retval     [0x1, 0xFFFF]
     */
    __STATIC_INLINE uint32_t DL_I2S_getWCLKDivider(const I2S_Regs *i2s)
    {
        uint32_t wclkDivider = i2s->WCLKDIV & I2S_WCLKDIV_WDIV_MASK;

        return (wclkDivider);
    }

    /**
     * @brief Set BCLK divider
     *        设置 BCLK 分频系数。
     *
     *  @param[in]  i2s            Pointer to the register overlay for the
     *                             peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  bclkDivider    BCLK divider. [ @ref DL_I2S_BDIV_MINIMUM, @ref DL_I2S_BDIV_MAXIMUM ]
     *                             BCLK 分频系数。
     *
     *  @sa         @ref DL_I2S_BDIV_INVALID
     */
    __STATIC_INLINE void DL_I2S_setBCLKDivider(I2S_Regs *i2s, uint32_t bclkDivider)
    {
        DL_Common_updateReg(&i2s->BCLKDIV, bclkDivider, I2S_BCLKDIV_BDIV_MASK);
    }

    /**
     *  @brief      Get BCLK divider
     *              获取 BCLK 分频系数。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     BCLK divider
     *              BCLK 分频系数。
     *
     *  @retval     [ @ref DL_I2S_BDIV_MINIMUM, @ref DL_I2S_BDIV_MAXIMUM ]
     *
     *  @sa         @ref DL_I2S_BDIV_INVALID
     */
    __STATIC_INLINE uint32_t DL_I2S_getBCLKDivider(const I2S_Regs *i2s)
    {
        uint32_t bclkDivider = i2s->BCLKDIV & I2S_BCLKDIV_BDIV_MASK;

        return (bclkDivider);
    }

    /**
     *  @brief Sets the sample word length in bits. In single-phase format, this is
     *  the exact number of bits per word. In dual-phase format, this is the
     *  maximum number of bits per word.
     *  设置每样本字长（位）。单相位为精确值，双相位为最大值。
     *
     *  @note Values written to the hardware should be 1 less than the desired
     *  sample word length e.g. a desired sample word length of 8 bits requires
     *  the value of 7 to be written. Sample word lengths less than 8 and above 32
     *  bits will result in undefined behavior.
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *  @param[in] sampleWordLength Sample word length (in bits) to set. [7, 31]
     *                              样本字长（硬件值 = 实际位数 - 1）。
     */
    __STATIC_INLINE void DL_I2S_setSampleWordLength(
        I2S_Regs *i2s, uint32_t sampleWordLength)
    {
        DL_Common_updateReg(
            &i2s->FMTCFG, sampleWordLength, I2S_FMTCFG_WORDLEN_MASK);
    }

    /**
     *  @brief Get the sample word length in bits
     *         获取每样本字长（位）。
     *
     *  @note Values read from the hardware will be 1 less than the true
     *  sample word length e.g. a value of 7 read from the hardware means that the
     *  sample word length is 8 bits.
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return Sample word length in bits
     *          样本字长（硬件值 = 实际位数 - 1）。
     *
     *  @retval Value in range [7, 31]
     */
    __STATIC_INLINE uint32_t DL_I2S_getSampleWordLength(const I2S_Regs *i2s)
    {
        uint32_t sampleWordLength = i2s->FMTCFG & I2S_FMTCFG_WORDLEN_MASK;

