zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2s.h
        return (sampleWordLength);
    }

    /**
     *  @brief Set between single or dual-phase format
     *         设置单相位或双相位帧格式。
     *
     *  @note Single-phase: DSP format
     *  @note Dual-phase: I2S, LJF and RJF formats
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *  @param[in] phase The sampling phase to use. One of @ref DL_I2S_PHASE
     *                   帧格式相位选择。
     */
    __STATIC_INLINE void DL_I2S_setFormatPhase(I2S_Regs *i2s, DL_I2S_PHASE phase)
    {
        DL_Common_updateReg(
            &i2s->FMTCFG, (uint32_t)phase, I2S_FMTCFG_DUALPHASE_MASK);
    }

    /**
     *  @brief Get the sampling phase being used
     *         获取当前帧格式相位模式。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return The sampling phase being used
     *          当前帧格式相位模式。
     *
     *  @retval One of @ref DL_I2S_PHASE
     */
    __STATIC_INLINE DL_I2S_PHASE DL_I2S_getFormatPhase(const I2S_Regs *i2s)
    {
        uint32_t phase = i2s->FMTCFG & I2S_FMTCFG_DUALPHASE_MASK;

        return ((DL_I2S_PHASE)(phase));
    }

    /**
     *  @brief Set the sample edge of data on BCLK.
     *         设置 BCLK 数据采样边沿。
     *
     *  @note On negative sample edge, data is sampled on the negative edge of
     *  BCLK and clocked out on the positive edge.
     *  @note On positive sample edge, data is sampled on the positive edge of
     *  BCLK and clocked out on the negative edge.
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *  @param[in] edge The sample edge to use. One of @ref DL_I2S_SAMPLE_EDGE
     *                  采样边沿选择。
     */
    __STATIC_INLINE void DL_I2S_setSampleEdge(
        I2S_Regs *i2s, DL_I2S_SAMPLE_EDGE edge)
    {
        DL_Common_updateReg(
            &i2s->FMTCFG, (uint32_t)edge, I2S_FMTCFG_SMPLEDGE_MASK);
    }

    /**
     *  @brief Gets the sample edge being used
     *         获取当前数据采样边沿。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return The sample edge being used
     *          当前采样边沿。
     *
     *  @retval One of @ref DL_I2S_SAMPLE_EDGE
     */
    __STATIC_INLINE DL_I2S_SAMPLE_EDGE DL_I2S_getSampleEdge(const I2S_Regs *i2s)
    {
        uint32_t edge = i2s->FMTCFG & I2S_FMTCFG_SMPLEDGE_MASK;

        return ((DL_I2S_SAMPLE_EDGE)(edge));
    }

    /**
     *  @brief Set the size of each sample word stored to or loaded from memory
     *         设置每样本的内存访问宽度。
     *
     *  @param[in] i2s    Pointer to the register overlay for the peripheral
     *                    I2S 外设寄存器基址。
     *  @param[in] length The memory access length to use.
     *                    One of @ref DL_I2S_MEMORY_LENGTH
     *                    内存访问宽度。
     */
    __STATIC_INLINE void DL_I2S_setMemoryLength(
        I2S_Regs *i2s, DL_I2S_MEMORY_LENGTH length)
    {
        DL_Common_updateReg(
            &i2s->FMTCFG, (uint32_t)length, I2S_FMTCFG_MEMLEN32_MASK);
    }

    /**
     *  @brief Get the size of sample words stored to or loaded from memory
     *         获取当前内存访问宽度。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return The memory access length being used
     *          当前内存访问宽度。
     *
     *  @retval One of @ref DL_I2S_MEMORY_LENGTH
     */
    __STATIC_INLINE DL_I2S_MEMORY_LENGTH DL_I2S_getMemoryLength(
        const I2S_Regs *i2s)
    {
        uint32_t length = i2s->FMTCFG & I2S_FMTCFG_MEMLEN32_MASK;

        return ((DL_I2S_MEMORY_LENGTH)(length));
    }

    /**
     *  @brief Set the number of BCLK periods to wait between a WCLK edge and the
     *  MSB of the first word in a phase
     *         设置 WCLK 边沿到首字最高位之间的 BCLK 延迟周期数。
     *
     *  @note Data delay of 0 - LJF and DSP formats
     *  @note Data delay of 1 - I2S and DSP formats
     *  @note Data delay of 2 (minimum) - RJF format
     *  @note Data delay of 255 (maximum) - RJF format

     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *  @param[in] dataDelay The data delay to use. One of @ref DL_I2S_DATA_DELAY
     *                       数据延迟配置。
     */
    __STATIC_INLINE void DL_I2S_setDataDelay(
        I2S_Regs *i2s, DL_I2S_DATA_DELAY dataDelay)
    {
        DL_Common_updateReg(
            &i2s->FMTCFG, (uint32_t)dataDelay, I2S_FMTCFG_DATADLY_MASK);
    }

    /**
     *  @brief Gets the data delay being used
     *         获取当前数据延迟配置。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return The data delay being used
     *          当前数据延迟。
     *
     *  @retval One of @ref DL_I2S_DATA_DELAY
     */
    __STATIC_INLINE DL_I2S_DATA_DELAY DL_I2S_getDataDelay(const I2S_Regs *i2s)
    {
        uint32_t dataDelay = i2s->FMTCFG & I2S_FMTCFG_DATADLY_MASK;

        return ((DL_I2S_DATA_DELAY)(dataDelay));
    }

    /**
     *  @brief Set the data pin behavior during empty slots
     *         设置空时隙期间数据引脚输出行为。
     *
     *  @param[in] i2s    Pointer to the register overlay for the peripheral
     *                    I2S 外设寄存器基址。
     *  @param[in] output The empty slot output behavior.
     *                    One of @ref DL_I2S_EMPTY_SLOT_OUTPUT
     *                    空时隙输出行为。
     */
    __STATIC_INLINE void DL_I2S_setEmptySlotOutput(
        I2S_Regs *i2s, DL_I2S_EMPTY_SLOT_OUTPUT output)
    {
        DL_Common_updateReg(
            &i2s->FMTCFG, (uint32_t)output, I2S_FMTCFG_EMPTYSLOTOUTPUT_MASK);
    }

    /**
     *  @brief Get the data pin behavior during empty slots
     *         获取空时隙期间数据引脚输出行为。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return The empty slot output behavior being used
     *          当前空时隙输出行为。
     *
     *  @retval One of @ref DL_I2S_EMPTY_SLOT_OUTPUT
     */
    __STATIC_INLINE DL_I2S_EMPTY_SLOT_OUTPUT DL_I2S_getEmptySlotOutput(
        const I2S_Regs *i2s)
    {
        uint32_t output = i2s->FMTCFG & I2S_FMTCFG_EMPTYSLOTOUTPUT_MASK;

        return ((DL_I2S_EMPTY_SLOT_OUTPUT)(output));
    }

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
    /**
     *  @brief Set the direction of the data pins
     *         设置 AD0/AD1 数据引脚方向。
     *
     *  @param[in] i2s               Pointer to the register overlay for the
     *                               peripheral
     *                               I2S 外设寄存器基址。
     *  @param[in] dataPin0Direction Data pin 0 (AD0) direction.
     *                               One of @ref DL_I2S_DATA_PIN_DIRECTION
     *                               AD0 方向。
     *  @param[in] dataPin1Direction Data pin 1 (AD1) direction.
     *                               One of @ref DL_I2S_DATA_PIN_DIRECTION
     *                               AD1 方向。
     */
    __STATIC_INLINE void DL_I2S_setDataPinsDirection(I2S_Regs *i2s,
                                                     DL_I2S_DATA_PIN_DIRECTION dataPin0Direction,
                                                     DL_I2S_DATA_PIN_DIRECTION dataPin1Direction)
    {
        DL_Common_updateReg(&i2s->DIRCFG,
                            ((((uint32_t)dataPin0Direction) << I2S_DIRCFG_AD0_OFS) |
                             (((uint32_t)dataPin1Direction) << I2S_DIRCFG_AD1_OFS)),
                            (I2S_DIRCFG_AD0_MASK | I2S_DIRCFG_AD1_MASK));
    }

#endif
    /**
     *  @brief Set the direction of data pin 0
     *         设置数据引脚 0（AD0）方向。
     *
     *  @param[in] i2s       Pointer to the register overlay for the peripheral
     *                       I2S 外设寄存器基址。
     *  @param[in] direction Data pin direction.
     *                       One of @ref DL_I2S_DATA_PIN_DIRECTION
     *                       引脚方向。
     */
    __STATIC_INLINE void DL_I2S_setDataPin0Direction(
        I2S_Regs *i2s, DL_I2S_DATA_PIN_DIRECTION direction)
    {
        DL_Common_updateReg(&i2s->DIRCFG,
                            ((uint32_t)(direction)) << I2S_DIRCFG_AD0_OFS, I2S_DIRCFG_AD0_MASK);
    }

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
    /**
     *  @brief Set the direction of data pin 1
     *         设置数据引脚 1（AD1）方向。
     *
     *  @param[in] i2s       Pointer to the register overlay for the peripheral
     *                       I2S 外设寄存器基址。
     *  @param[in] direction Data pin direction.
     *                       One of @ref DL_I2S_DATA_PIN_DIRECTION
     *                       引脚方向。
     */
    __STATIC_INLINE void DL_I2S_setDataPin1Direction(
        I2S_Regs *i2s, DL_I2S_DATA_PIN_DIRECTION direction)
    {
        DL_Common_updateReg(&i2s->DIRCFG,
                            ((uint32_t)(direction)) << I2S_DIRCFG_AD1_OFS, I2S_DIRCFG_AD1_MASK);
    }

#endif
    /**
     *  @brief Get the direction of data pin 0
     *         获取数据引脚 0（AD0）方向。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return Direction of the data pin
     *          引脚方向。
     *
     *  @retval One of @ref DL_I2S_DATA_PIN_DIRECTION
     */
    __STATIC_INLINE DL_I2S_DATA_PIN_DIRECTION DL_I2S_getDataPin0Direction(
        const I2S_Regs *i2s)
    {
        uint32_t direction = i2s->DIRCFG & I2S_DIRCFG_AD0_MASK;

