zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2s.h
        return ((DL_I2S_DATA_PIN_DIRECTION)(direction >> I2S_DIRCFG_AD0_OFS));
    }

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
    /**
     *  @brief Get the direction of data pin 1
     *         获取数据引脚 1（AD1）方向。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return Direction of the data pin
     *          引脚方向。
     *
     *  @retval One of @ref DL_I2S_DATA_PIN_DIRECTION
     */
    __STATIC_INLINE DL_I2S_DATA_PIN_DIRECTION DL_I2S_getDataPin1Direction(
        const I2S_Regs *i2s)
    {
        uint32_t direction = i2s->DIRCFG & I2S_DIRCFG_AD1_MASK;

        return ((DL_I2S_DATA_PIN_DIRECTION)(direction >> I2S_DIRCFG_AD1_OFS));
    }

#endif
    /**
     *  @brief Set the valid channel mask of data pin 0
     *         设置数据引脚 0（AD0）有效通道掩码。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *  @param[in] channelMask Valid channel mask of the data pin
     *                         有效通道掩码 [0, 0xFF]。
     */
    __STATIC_INLINE void DL_I2S_setDataPin0ChannelMask(
        I2S_Regs *i2s, uint32_t channelMask)
    {
        i2s->WMASK0 = channelMask;
    }

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
    /**
     *  @brief Set the valid channel mask of data pin 1
     *         设置数据引脚 1（AD1）有效通道掩码。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *  @param[in] channelMask Valid channel mask of the data pin
     *                         有效通道掩码 [0, 0xFF]。
     */
    __STATIC_INLINE void DL_I2S_setDataPin1ChannelMask(
        I2S_Regs *i2s, uint32_t channelMask)
    {
        i2s->WMASK1 = channelMask;
    }

#endif
    /**
     *  @brief Get the valid channel mask of data pin 0
     *         获取数据引脚 0（AD0）有效通道掩码。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return Valid channel mask of the data pin
     *          有效通道掩码。
     *
     *  @retval The valid channel mask of the data pin with the range [0, 0xFF].
     *          For single-phase mode, each bit represents 1 channel. For
     *          dual-phase mode, only the first 2 LSBs are considered.
     */
    __STATIC_INLINE uint32_t DL_I2S_getDataPin0ChannelMask(const I2S_Regs *i2s)
    {
        uint32_t channelMask = i2s->WMASK0 & I2S_WMASK0_MASK_MASK;

        return (channelMask);
    }

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
    /**
     *  @brief Get the valid channel mask of data pin 1
     *         获取数据引脚 1（AD1）有效通道掩码。
     *
     *  @param[in] i2s Pointer to the register overlay for the peripheral
     *                 I2S 外设寄存器基址。
     *
     *  @return Valid channel mask of the data pin
     *          有效通道掩码。
     *
     *  @retval The valid channel mask of the data pin with the range [0, 0xFF].
     *          For single-phase mode, each bit represents 1 channel. For
     *          dual-phase mode, only the first 2 LSBs are considered.
     */
    __STATIC_INLINE uint32_t DL_I2S_getDataPin1ChannelMask(const I2S_Regs *i2s)
    {
        uint32_t channelMask = i2s->WMASK1 & I2S_WMASK1_MASK_MASK;

        return (channelMask);
    }

#endif
    /**
     *  @brief      Get TX FIFO threshold level
     *              获取 TX FIFO 中断触发阈值。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     Indicates at what fill level in the TX FIFO a threshold will be
     *              generated
     *              当前 TX FIFO 触发阈值。
     *
     *  @retval     One of @ref DL_I2S_TX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_I2S_TX_FIFO_LEVEL DL_I2S_getTXFIFOThreshold(
        const I2S_Regs *i2s)
    {
        uint32_t level = i2s->IFLS & I2S_IFLS_TXIFLSEL_MASK;

        return (DL_I2S_TX_FIFO_LEVEL)(level);
    }

    /**
     *  @brief      Set TX FIFO threshold level
     *              设置 TX FIFO 中断触发阈值。
     *
     *  @note Randomly changing FIFO levels when FIFO has contents might lead to
     *  unexpected behavior. It is recommended to clear the FIFO before changing
     *  FIFO threshold levels.
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *  @param[in]  level   Indicates at what fill level in the TX FIFO a threshold
     *                      will be generated.
     *                      One of @ref DL_I2S_TX_FIFO_LEVEL.
     *                      TX FIFO 触发阈值。
     *
     *  @sa         DL_I2S_clearTXFIFO
     */
    __STATIC_INLINE void DL_I2S_setTXFIFOThreshold(
        I2S_Regs *i2s, DL_I2S_TX_FIFO_LEVEL level)
    {
        DL_Common_updateReg(&i2s->IFLS, (uint32_t)level, I2S_IFLS_TXIFLSEL_MASK);
    }

    /**
     *  @brief      Get RX FIFO threshold level
     *              获取 RX FIFO 中断触发阈值。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     Indicates at what fill level in the RX FIFO a threshold will be
     *              generated
     *              当前 RX FIFO 触发阈值。
     *
     *  @retval     One of @ref DL_I2S_RX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_I2S_RX_FIFO_LEVEL DL_I2S_getRXFIFOThreshold(
        const I2S_Regs *i2s)
    {
        uint32_t level = i2s->IFLS & I2S_IFLS_RXIFLSEL_MASK;

        return (DL_I2S_RX_FIFO_LEVEL)(level);
    }

    /**
     *  @brief      Set RX FIFO threshold level
     *              设置 RX FIFO 中断触发阈值。
     *
     *  @note Randomly changing FIFO levels when FIFO has contents might lead to
     *  unexpected behavior. It is recommended to clear the FIFO before changing
     *  FIFO threshold levels.
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *  @param[in]  level   Indicates at what fill level in the RX FIFO a threshold
     *                      will be generated.
     *                      One of @ref DL_I2S_RX_FIFO_LEVEL.
     *                      RX FIFO 触发阈值。
     *
     *  @sa         DL_I2S_clearRXFIFO
     */
    __STATIC_INLINE void DL_I2S_setRXFIFOThreshold(
        I2S_Regs *i2s, DL_I2S_RX_FIFO_LEVEL level)
    {
        DL_Common_updateReg(&i2s->IFLS, (uint32_t)level, I2S_IFLS_RXIFLSEL_MASK);
    }

    /**
     *  @brief      Checks if RX FIFO clear is complete
     *              查询 RX FIFO 清除是否完成。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     If RX FIFO clear is complete
     *              RX FIFO 清除是否完成。
     *
     *  @retval     true if RX FIFO clear is complete
     *  @retval     false if RX FIFO clear is complete
     */
    __STATIC_INLINE bool DL_I2S_isRXFIFOClearComplete(const I2S_Regs *i2s)
    {
        return ((i2s->STAT & I2S_STAT_RXCLR_MASK) == I2S_STAT_RXCLR_SET);
    }

    /**
     *  @brief      Checks if TX FIFO clear is complete
     *              查询 TX FIFO 清除是否完成。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     If TX FIFO clear is complete
     *              TX FIFO 清除是否完成。
     *
     *  @retval     true if TX FIFO clear is complete
     *  @retval     false if TX FIFO clear is complete
     */
    __STATIC_INLINE bool DL_I2S_isTXFIFOClearComplete(const I2S_Regs *i2s)
    {
        return ((i2s->STAT & I2S_STAT_TXCLR_MASK) == I2S_STAT_TXCLR_SET);
    }

    /**
     *  @brief      Enable I2S interrupts
     *              使能 I2S 中断。
     *
     *  @param[in]  i2s            Pointer to the register overlay for the
     *                             peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
     *                             @ref DL_I2S_INTERRUPT.
     *                             中断掩码。
     */
    __STATIC_INLINE void DL_I2S_enableInterrupt(
        I2S_Regs *i2s, uint32_t interruptMask)
    {
        i2s->CPU_INT.IMASK |= interruptMask;
    }

    /**
     *  @brief      Disable I2S interrupts
     *              禁用 I2S 中断。
     *
     *  @param[in]  i2s            Pointer to the register overlay for the
     *                             peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
     *                             @ref DL_I2S_INTERRUPT.
     *                             中断掩码。
     */
    __STATIC_INLINE void DL_I2S_disableInterrupt(
        I2S_Regs *i2s, uint32_t interruptMask)
    {
        i2s->CPU_INT.IMASK &= ~(interruptMask);
    }

    /**
     *  @brief      Check which I2S interrupts are enabled
     *              查询哪些 I2S 中断已使能。
     *
     *  @param[in]  i2s            Pointer to the register overlay for the
     *                             peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_INTERRUPT.
     *                             中断掩码。
     *
     *  @return     Which of the requested I2S interrupts are enabled
     *              已使能的中断位。
     *
     *  @retval     Bitwise OR of @ref DL_I2S_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2S_getEnabledInterrupts(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->CPU_INT.IMASK & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of enabled I2S interrupts
     *              查询已使能的 I2S 中断标志。
     *
     *  Checks if any of the I2S interrupts that were previously enabled are
     *  pending.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the
     *                             peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_INTERRUPT.
     *                             中断掩码。
     *
     *  @return     Which of the requested I2S interrupts are pending
     *              挂起的中断标志位。
     *
     *  @retval     Bitwise OR of @ref DL_I2S_INTERRUPT values
     *
     *  @sa         DL_I2S_enableInterrupt
     */
    __STATIC_INLINE uint32_t DL_I2S_getEnabledInterruptStatus(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->CPU_INT.MIS & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of any I2S interrupt
     *              查询任意 I2S 中断原始标志（无需先使能）。
     *
     *  Checks if any of the I2S interrupts are pending. Interrupts do not have to
     *  be previously enabled.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the
     *                             peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_INTERRUPT.
     *                             中断掩码。
     *
     *  @return     Which of the requested I2S interrupts are pending
     *              挂起的原始中断标志位。
     *
     *  @retval     Bitwise OR of @ref DL_I2S_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2S_getRawInterruptStatus(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->CPU_INT.RIS & interruptMask);
    }

    /**
     *  @brief      Get highest priority pending I2S interrupt
     *              获取最高优先级待处理 I2S 中断索引。
     *
     *  Checks if any of the I2S interrupts are pending. Interrupts do not have to
     *  be previously enabled.
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @return     The highest priority pending I2S interrupt
     *              最高优先级待处理中断索引。
     *
     *  @retval     One of @ref DL_I2S_IIDX
     */
    __STATIC_INLINE DL_I2S_IIDX DL_I2S_getPendingInterrupt(const I2S_Regs *i2s)
    {
        return ((DL_I2S_IIDX)i2s->CPU_INT.IIDX);
    }

    /**
     *  @brief      Clear pending I2S interrupts
     *              清除挂起的 I2S 中断标志。
     *
     *  @param[in]  i2s            Pointer to the register overlay for the
     *                             peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
     *                             @ref DL_I2S_INTERRUPT.
     *                             中断掩码。
     */
    __STATIC_INLINE void DL_I2S_clearInterruptStatus(
        I2S_Regs *i2s, uint32_t interruptMask)
    {
        i2s->CPU_INT.ICLR = interruptMask;
    }

    /**
     *  @brief Enables I2S interrupt for triggering the DMA receive event
     *         使能 I2S DMA 接收触发中断。
     *
     * Enables the I2S interrupt to be used as the condition to generate an
     * event to directly trigger the DMA. This API configures the DMA_TRIG_RX
     * register, which is the event publisher used for triggering the DMA to do a
     * receive data transfer.
     *
     * @note Only one interrupt source should be enabled at a time.
     *
     *  @param[in]  i2s        Pointer to the register overlay for the peripheral
     *                         I2S 外设寄存器基址。
     *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
     *                         the DMA. One of @ref DL_I2S_DMA_INTERRUPT.
     *                         DMA 触发中断源。
     */
    __STATIC_INLINE void DL_I2S_enableDMAReceiveEvent(
        I2S_Regs *i2s, uint32_t interrupt)
    {
        i2s->DMA_TRIG_RX.IMASK = interrupt;
    }

    /**
     *  @brief Enables I2S interrupt for triggering the DMA transmit event
     *         使能 I2S DMA 发送触发中断。
     *
     * Enables the I2S interrupt to be used as the condition to generate an
     * event to directly trigger the DMA. This API configures the DMA_TRIG_TX
     * register, which is the event publisher used for triggering the DMA to do a
     * transmit data transfer.
     *
     * @note Only one interrupt source should be enabled at a time.
     *
     *  @param[in]  i2s        Pointer to the register overlay for the peripheral
     *                         I2S 外设寄存器基址。
     *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
     *                         the DMA. One of @ref DL_I2S_DMA_INTERRUPT.
     *                         DMA 触发中断源。
     */
    __STATIC_INLINE void DL_I2S_enableDMATransmitEvent(
        I2S_Regs *i2s, uint32_t interrupt)
    {
        i2s->DMA_TRIG_TX.IMASK = interrupt;
    }

    /**
     *  @brief Disables I2S interrupt from triggering the DMA receive event
     *         禁用 I2S DMA 接收触发中断。
     *
     * Disables the I2S interrupt from being used as the condition to generate an
     * event to directly trigger the DMA. This API configures the DMA_TRIG_RX
     * register, which is the event publisher used for triggering the DMA to do a
     * receive data transfer.
     *
     *  @param[in]  i2s        Pointer to the register overlay for the peripheral
     *                         I2S 外设寄存器基址。
     *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
     *                         the DMA. One of @ref DL_I2S_DMA_INTERRUPT.
     *                         DMA 触发中断源。
     */
    __STATIC_INLINE void DL_I2S_disableDMAReceiveEvent(
        I2S_Regs *i2s, uint32_t interrupt)
    {
        i2s->DMA_TRIG_RX.IMASK &= ~(interrupt);
    }

    /**
     *  @brief Disables I2S interrupt from triggering the DMA transmit event
     *         禁用 I2S DMA 发送触发中断。
     *
     * Disables the I2S interrupt from being used as the condition to generate an
     * event to directly trigger the DMA. This API configures the DMA_TRIG_TX
     * register, which is the event publisher used for triggering the DMA to do a
     * transmit data transfer.
     *
     *  @param[in]  i2s        Pointer to the register overlay for the peripheral
     *                         I2S 外设寄存器基址。
     *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
     *                         the DMA. One of @ref DL_I2S_DMA_INTERRUPT.
     *                         DMA 触发中断源。
     */
    __STATIC_INLINE void DL_I2S_disableDMATransmitEvent(
        I2S_Regs *i2s, uint32_t interrupt)
    {
        i2s->DMA_TRIG_TX.IMASK &= ~(interrupt);
    }

    /**
     *  @brief Check which I2S interrupt for DMA receive events is enabled
     *         查询哪些 DMA 接收触发中断已使能。
     *
     *  This API checks the DMA_TRIG_RX register, which is used for triggering the
     *  DMA to do a receive data transfer.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_DMA_INTERRUPT.
     *                             中断掩码。
     *
     *  @note Only one interrupt source should be enabled at a time.
     *
     *  @return     The requested I2S interrupt status
     *              已使能的 DMA 接收触发中断。
     *
     *  @retval     One of @ref DL_I2S_DMA_INTERRUPT
     */
    __STATIC_INLINE uint32_t DL_I2S_getEnabledDMAReceiveEvent(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->DMA_TRIG_RX.IMASK & interruptMask);
    }

    /**
     *  @brief Check which I2S interrupt for DMA transmit events is enabled
     *         查询哪些 DMA 发送触发中断已使能。
     *
     *  This API checks the DMA_TRIG_TX register, which is used for triggering the
     *  DMA to do a transmit data transfer.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_DMA_INTERRUPT.
     *                             中断掩码。
     *
     *  @note Only one interrupt source should be enabled at a time.
     *
     *  @return     The requested I2S interrupt status
     *              已使能的 DMA 发送触发中断。
     *
     *  @retval     One of @ref DL_I2S_DMA_INTERRUPT
     */
    __STATIC_INLINE uint32_t DL_I2S_getEnabledDMATransmitEvent(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->DMA_TRIG_TX.IMASK & interruptMask);
    }

    /**
     *  @brief Check interrupt flag of enabled I2S interrupt for DMA receive event
     *         查询已使能的 DMA 接收触发中断标志。
     *
     *  Checks if any of the I2S interrupts for the DMA receive event that were
     *  previously enabled are pending.
     *  This API checks the DMA_TRIG_RX register, which is  used for triggering the
     *  DMA to do a receive event.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_DMA_INTERRUPT.
     *                             中断掩码。
     *
     *  @note Only one interrupt source should be enabled at a time.
     *
     *  @return     The requested I2S interrupt status
     *              挂起的 DMA 接收触发中断标志。
     *
     *  @retval     One of @ref DL_I2S_DMA_INTERRUPT
     *
     *  @sa         DL_I2S_enableDMAReceiveEvent
     */
    __STATIC_INLINE uint32_t DL_I2S_getEnabledDMAReceiveEventStatus(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->DMA_TRIG_RX.MIS & interruptMask);
    }

    /**
     *  @brief Check interrupt flag of enabled I2S interrupt for DMA transmit event
     *         查询已使能的 DMA 发送触发中断标志。
     *
     *  Checks if any of the I2S interrupts for the DMA transmit event that were
     *  previously enabled are pending.
     *  This API checks the DMA_TRIG_TX register, which is  used for triggering the
     *  DMA to do a transmit event.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_DMA_INTERRUPT.
     *                             中断掩码。
     *
     *  @note Only one interrupt source should be enabled at a time.
     *
     *  @return     The requested I2S interrupt status
     *              挂起的 DMA 发送触发中断标志。
     *
     *  @retval     One of @ref DL_I2S_DMA_INTERRUPT
     *
     *  @sa         DL_I2S_enableDMATransmitEvent
     */
    __STATIC_INLINE uint32_t DL_I2S_getEnabledDMATransmitEventStatus(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->DMA_TRIG_TX.MIS & interruptMask);
    }

    /**
     *  @brief Check interrupt flag of any I2S interrupt for DMA receive event
     *         查询 DMA 接收触发中断原始标志（无需先使能）。
     *
     *  Checks if any of the I2S interrupts for DMA receive event are pending.
     *  Interrupts do not have to be previously enabled.
     *  This API checks the DMA_TRIG_RX register, which is used for triggering the
     *  DMA to do a receive event.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_DMA_INTERRUPT.
     *                             中断掩码。
     *
     *  @return     Which of the requested I2S interrupts are pending
     *              挂起的原始 DMA 接收触发中断标志。
     *
     *  @retval     Bitwise OR of @ref DL_I2S_DMA_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2S_getRawDMAReceiveEventStatus(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->DMA_TRIG_RX.RIS & interruptMask);
    }

    /**
     *  @brief Check interrupt flag of any I2S interrupt for DMA transmit event
     *         查询 DMA 发送触发中断原始标志（无需先使能）。
     *
     *  Checks if any of the I2S interrupts for DMA transmit event are pending.
     *  Interrupts do not have to be previously enabled.
     *  This API checks the DMA_TRIG_TX register, which is used for triggering the
     *  DMA to do a transmit event.
     *
     *  @param[in]  i2s            Pointer to the register overlay for the peripheral
     *                             I2S 外设寄存器基址。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2S_DMA_INTERRUPT.
     *                             中断掩码。
     *
     *  @return     Which of the requested I2S interrupts are pending
     *              挂起的原始 DMA 发送触发中断标志。
     *
     *  @retval     Bitwise OR of @ref DL_I2S_DMA_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2S_getRawDMATransmitEventStatus(
        const I2S_Regs *i2s, uint32_t interruptMask)
    {
        return (i2s->DMA_TRIG_TX.RIS & interruptMask);
    }

