zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2s.h
    /**
     *  @brief      Suspend external communication
     *              挂起外部通信，当前传输完成后停止，寄存器配置保留。
     *
     *  Ongoing communication will complete, and further external communications
     *  are stopped. Tranmit line(s) will be driven to idle state, and further
     *  toggles on the receive line(s) will not be processed. Once suspend is
     *  requested, the CPU should poll to ensure that the device has reached idle.
     *  When the device is idle, the transmit FIFO should be flushed, and the
     *  receive FIFO should be drained prior to disabling the module.
     *  After suspending the module, the I2S register configurations are retained.
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @sa DL_I2S_disable
     *  @sa DL_I2S_resume
     */
    __STATIC_INLINE void DL_I2S_suspend(I2S_Regs *i2s)
    {
        DL_Common_updateReg(
            &i2s->FMTCFG, I2S_FMTCFG_SUSPEND_ENABLE, I2S_FMTCFG_SUSPEND_MASK);
    }

    /**
     *  @brief      Resume functional mode
     *              恢复正常通信模式。
     *
     *  Functional communication can be resumed by calling this API, and enabling
     *  the module
     *
     *  @param[in]  i2s  Pointer to the register overlay for the peripheral
     *                   I2S 外设寄存器基址。
     *
     *  @sa DL_I2S_enable
     *  @sa DL_I2S_suspend
     */
    __STATIC_INLINE void DL_I2S_resume(I2S_Regs *i2s)
    {
        DL_Common_updateReg(
            &i2s->FMTCFG, I2S_FMTCFG_SUSPEND_DISABLE, I2S_FMTCFG_SUSPEND_MASK);
    }

    /**
     *  @brief      Set the clock source for the I2S peripheral
     *              设置 I2S 外设主时钟源。
     *
     *  @param[in]  i2s         Pointer to the register overlay for the peripheral
     *                          I2S 外设寄存器基址。
     *
     *  @param[in]  clockSource Source of the clock for I2S.
     *                          One of @ref DL_I2S_CLOCK_SOURCE.
     *                          主时钟源选择。
     */
    __STATIC_INLINE void DL_I2S_setClockSource(
        I2S_Regs *i2s, DL_I2S_CLOCK_SOURCE clockSource)
    {
        i2s->GPRCM.CLKCFG = (I2S_CLKCFG_KEY_UNLOCK | (uint32_t)clockSource);
    }

    /**
     *  @brief      Get I2S audio clock configuration
     *              获取 I2S 当前主时钟源配置。
     *
     *  @param[in]  i2s     Pointer to the register overlay for the peripheral
     *                      I2S 外设寄存器基址。
     *
     *  @return     The currently configured clock for I2S
     *              当前主时钟源。
     *
     *  @retval     One of @ref DL_I2S_CLOCK_SOURCE
     */
    __STATIC_INLINE DL_I2S_CLOCK_SOURCE DL_I2S_getClockSource(const I2S_Regs *i2s)
    {
        uint32_t clockSource = i2s->GPRCM.CLKCFG & I2S_CLKCFG_DAICLK_MASK;

        return ((DL_I2S_CLOCK_SOURCE)(clockSource));
    }

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_I2S__ */

#endif /* ti_dl_dl_i2s__include */
/** @}*/
